Revit 2027 API
BuiltInFailures.CurtainWallFailures.DeletingCurtainSystemFaceGridLines Property
 Deleting Grid Lines residing on faces that no longer are part of a Curtain System.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DeletingCurtainSystemFaceGridLines { get; }
Public Shared ReadOnly Property DeletingCurtainSystemFaceGridLines As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DeletingCurtainSystemFaceGridLines {
	FailureDefinitionId^ get ();
}
static member DeletingCurtainSystemFaceGridLines : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace